app/controllers/achievements_controller.rb

SELECT "achievements".* FROM "achievements"
---
  def index
    @achievements = Achievement.all