app/controllers/badges_controller.rb

  def index
    @badges = Badge.all
---
SELECT "badges".* FROM "badges"

  def create
    @badge = Badge.new(badge_params)

    if @badge.save
---
INSERT INTO "badges" ("user_id", "achievement_id", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["achievement_id", 1], ["url", "wwww.google.com"], ["created_at", "2017-09-20 01:42:07.384422"], ["updated_at", "2017-09-20 01:42:07.384422"]]