app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "television_correct" = $1, "total_correct" = $2, "total_score" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["television_correct", 1], ["total_correct", 4], ["total_score", 400], ["updated_at", "2017-09-20 08:39:06.582567"], ["id", 11]]